import React from "react";

const TermsConditions = () => {
  return (
    <div className="max-w-2xl mt-12 mb-12 mx-auto p-6 bg-white shadow-lg rounded-2xl border border-gray-200">
      <h2 className="text-2xl font-bold text-gray-800 mb-4">
        শর্তাবলী ও নীতিমালা
      </h2>
      <p className="text-gray-600 mb-4">
        "আমরা", "আমাদের" বা "সিরামিকস এন্ড ফুড প্রোডাক্ট" নামে পরিচিত Online
        Shop :
        <span className="font-semibold"> ceramicandfoodproducts.com </span>
        স্বাগতম। এই সাইটটি ব্যবহার করার আগে দয়া করে এই শর্তাদি ও শর্তাদি
        সাবধানে পড়ুন। সাইটটি ব্যবহার করে, আপনি এই শর্তাদি এবং শর্তাদি স্বীকার
        করেন এবং প্রতিনিধিত্ব করেন যে আপনি এই শর্তাদি এবং শর্তাদি ("ব্যবহারকারী
        চুক্তি") মেনে চলতে সম্মত হন। এই ব্যবহারকারী চুক্তিটি আপনার সাইটের
        ব্যবহারের উপর কার্যকর বলে মনে করা হয় যা আপনার এই শর্তাদি সম্মতির ইঙ্গিত
        দেয়। আপনি যদি এই ব্যবহারকারীর চুক্তির দ্বারা আবদ্ধ হতে সম্মত না হন তবে
        দয়া করে এই সাইটটি ব্যবহার করবেন না।
      </p>
      <p className="text-gray-600">
        সাইটটি কোনও পূর্ব বিজ্ঞপ্তি ছাড়াই যে কোনও সময় এই শর্তাদি এবং শর্তাদির
        অংশগুলি পরিবর্তন, সংশোধন, যোগ বা অপসারণ করার অধিকার সংরক্ষণ করে। অন্য
        কোনও নোটিশ সরবরাহ না করে সাইটে পোস্ট করা হলে পরিবর্তনগুলি কার্যকর হবে।
        আপডেটের জন্য দয়া করে এই শর্তাবলী নিয়মিত চেক করুন। ব্যবহারের শর্তাবলীতে
        পরিবর্তনগুলি পোস্ট করার পরে আপনার সাইটের অব্যাহত ব্যবহার সেই
        পরিবর্তনগুলির আপনার গ্রহণযোগ্যতা গঠন করে।
      </p>
    </div>
  );
};

export default TermsConditions;
