import React from "react";

const PrivacyPolicy = () => {
  return (
    <div className="max-w-2xl mx-auto p-6 bg-white shadow-lg rounded-2xl border border-gray-200">
      <h2 className="text-2xl font-bold text-gray-800 mb-4">গোপনীয়তা নীতি</h2>
      <p className="text-gray-600 mb-4">
        আমরা <span className="font-semibold">সিরামিকস এন্ড ফুড প্রোডাক্ট</span>{" "}
        দ্বারা পরিচালিত Online Shop:{" "}
        <span className="font-semibold">ceramicandfoodproducts.com</span>{" "}
        ওয়েবসাইটে ("সাইট") আপনাকে স্বাগতম। আমরা আপনার গোপনীয়তাকে সম্মান করি
        এবং আপনার ব্যক্তিগত তথ্য রক্ষা করতে চাই। আরও জানতে, দয়া করে এই
        গোপনীয়তা নীতিটি পড়ুন।
      </p>
      <p className="text-gray-600 mb-4">
        এই গোপনীয়তা নীতিটি ব্যাখ্যা করে যে আমরা কীভাবে আপনার ব্যক্তিগত তথ্য
        সংগ্রহ, ব্যবহার এবং (নির্দিষ্ট শর্তাবলীর অধীনে) প্রকাশ করি। এটি আপনার
        তথ্য সুরক্ষিত করতে আমরা যে পদক্ষেপগুলি গ্রহণ করেছি তাও ব্যাখ্যা করে।
        আপনি যদি সাইটটি পরিদর্শন করেন, তবে আপনি এই নীতিতে বর্ণিত অনুশীলনগুলি
        গ্রহণ করেন।
      </p>
      <p className="text-gray-600 mb-4">
        ডেটা সুরক্ষা একটি বিশ্বাসের বিষয় এবং আপনার গোপনীয়তা আমাদের কাছে
        গুরুত্বপূর্ণ। আমরা কেবলমাত্র আপনার নাম এবং অন্যান্য তথ্য ব্যবহার করব যা
        এই গোপনীয়তা নীতিতে নির্ধারিত পদ্ধতিতে আপনার সাথে সম্পর্কিত।
      </p>
      <p className="text-gray-600 mb-4">
        আমরা আপনার তথ্য ততক্ষণ রাখবো যতক্ষণ পর্যন্ত আমাদের আইন অনুসারে প্রয়োজন
        হয় অথবা যে উদ্দেশ্যে এটি সংগ্রহ করা হয়েছিল তার জন্য প্রাসঙ্গিক হয়।
      </p>
      <p className="text-gray-600 mb-4">
        আপনি ব্যক্তিগত বিবরণ প্রদান না করেই সাইটটি পরিদর্শন করতে এবং ব্রাউজ করতে
        পারেন। সাইটে আপনার পরিদর্শনের সময় আপনি বেনামী থাকবেন।
      </p>
      <p className="text-gray-600">
        এই গোপনীয়তা নীতি সম্পর্কে আপনার যদি কোনও প্রশ্ন থাকে, তবে আপনাকে আমাদের
        গ্রাহক পরিষেবা বিভাগের সাথে ইমেল করে যোগাযোগ করতে হবে:
        <span className="font-semibold"> info@ceramicandfoodproducts.com</span>
      </p>
    </div>
  );
};

export default PrivacyPolicy;
